#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
random_password.api_auth_token: Refreshing state... [id=none]
data.archive_file.lambda_package: Reading...
data.aws_iam_policy_document.lambda_logging: Reading...
aws_api_gateway_rest_api.monolith: Refreshing state... [id=ids98mdyx8]
data.aws_secretsmanager_secret.stripe_api_key: Reading...
data.aws_iam_policy_document.lambda: Reading...
aws_secretsmanager_secret.api_auth_token: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:757214766189:secret:user-authentication-service-test-api-token-EBmEab]
data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=4224822605]
data.aws_iam_policy_document.lambda: Read complete after 0s [id=2690255455]
aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::757214766189:policy/user-authentication-service-test-lambda-logging]
aws_iam_role.lambda: Refreshing state... [id=user-authentication-service-test-lambda]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=user-authentication-service-test-lambda-20230611142302062900000001]
data.aws_secretsmanager_secret.stripe_api_key: Read complete after 1s [id=arn:aws:secretsmanager:eu-central-1:757214766189:secret:stripe-api-keys-test-PRbf1C]
data.aws_secretsmanager_secret_version.stripe_api_key: Reading...
aws_secretsmanager_secret_version.api_auth_token: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:757214766189:secret:user-authentication-service-test-api-token-EBmEab|AAFBC5FA-E8AD-4CEE-9BFD-FD8803F70566]
aws_api_gateway_resource.root_proxy: Refreshing state... [id=4i7cmd]
data.aws_secretsmanager_secret_version.stripe_api_key: Read complete after 0s [id=arn:aws:secretsmanager:eu-central-1:757214766189:secret:stripe-api-keys-test-PRbf1C|AWSCURRENT]
data.archive_file.lambda_package: Read complete after 2s [id=32658487339462a56c85a0dd9ef84e089aae185f]
aws_lambda_function.monolith: Refreshing state... [id=user-authentication-service-test-monolith]
aws_api_gateway_method.root_proxy_any: Refreshing state... [id=agm-ids98mdyx8-4i7cmd-ANY]
aws_api_gateway_method.root_proxy_options: Refreshing state... [id=agm-ids98mdyx8-4i7cmd-OPTIONS]
aws_api_gateway_method_response.root_proxy_any_200: Refreshing state... [id=agmr-ids98mdyx8-4i7cmd-ANY-200]
aws_api_gateway_method_response.root_proxy_options_200: Refreshing state... [id=agmr-ids98mdyx8-4i7cmd-OPTIONS-200]
aws_api_gateway_integration.root_proxy_options_mock: Refreshing state... [id=agi-ids98mdyx8-4i7cmd-OPTIONS]
aws_api_gateway_integration_response.root_proxy_options_200: Refreshing state... [id=agir-ids98mdyx8-4i7cmd-OPTIONS-200]
aws_api_gateway_integration_response.root_proxy_options_mock: Refreshing state... [id=agir-ids98mdyx8-4i7cmd-OPTIONS-200]
aws_lambda_permission.api_gateway_invocation: Refreshing state... [id=AllowExecutionFromApiGateway]
aws_api_gateway_integration.root_proxy: Refreshing state... [id=agi-ids98mdyx8-4i7cmd-ANY]
aws_api_gateway_deployment.monolith: Refreshing state... [id=f6hi1n]
aws_api_gateway_integration_response.root_proxy_any_200: Refreshing state... [id=agir-ids98mdyx8-4i7cmd-ANY-200]
aws_api_gateway_stage.monolith: Refreshing state... [id=ags-ids98mdyx8-v1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.monolith will be updated in-place
  ~ resource "aws_lambda_function" "monolith" {
        id                             = "user-authentication-service-test-monolith"
      ~ last_modified                  = "2023-06-28T09:59:15.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:757214766189:function:user-authentication-service-test-monolith:56" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:757214766189:function:user-authentication-service-test-monolith:56/invocations" -> (known after apply)
      ~ source_code_hash               = "mJ1RrWbuWM4mrtBxu5essEr+VJt1neIAzHH07g1Bqmk=" -> "yWwaNDi9fa5tUt+XGQFaYknPnLbj0m5Wy3QeCjh+cZQ="
        tags                           = {}
      ~ version                        = "56" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Workflow: `Deployment`*